<?xml version="1.0" encoding="utf-8"?>
<search>
  <entry>
    <title>C</title>
    <url>/posts/2020-08-001.html</url>
    <content><![CDATA[<p>测试环境：Visual Studio Community 2019</p>
<h3 id="作用域"><a class="markdownIt-Anchor" href="#作用域"></a> 作用域</h3>
<p>有四种不同类型的作用域----文件作用域，函数作用域，代码块作用域和原型作用域。</p>
<ul>
<li>代码块作用域：位于一对花括号之间的所有语句称为一个代码块，代码块开始声明的具有~。</li>
<li>文件作用域：任何在所有代码块之外声明的标识符都有~。</li>
<li>原型作用域：只适用于在函数原型中声明的参数名。</li>
<li>函数作用域：只适用于语句标签，语句标签用于goto语句。</li>
</ul>
<h3 id="链接属性"><a class="markdownIt-Anchor" href="#链接属性"></a> 链接属性</h3>
<p>链接属性一共有三种：external,internal和none。</p>
<ul>
<li>
<p>external：无论声明多少次，几个源文件中的声明都表示同一实体；</p>
</li>
<li>
<p>internal：只有同一文件内才为同一实体；</p>
</li>
<li>
<p>none：多个声明被当作独立不同的实体；</p>
</li>
<li>
<p>在缺省情况下，文件作用域内（不存在于任意函数内）的变量或函数为external。如果在它前面加上static可以使它的链接属性变为internal，例如：</p>
<pre><code>  static int a;
</code></pre>
</li>
</ul>
<p>那么变量a就是这个源文件所私有。</p>
<ul>
<li>
<p>static 只对缺省链接属性为external的声明才有改变链接属性的效果。</p>
</li>
<li>
<p>extern关键字，只能用于声明变量，不能用于定义（除非声明时有初始化，才被当作定义）。当缺省时既可以为声明，也可以是定义。</p>
<pre><code>  int a;
  extern int b;
  extern int c=10;
</code></pre>
</li>
</ul>
<p>a：即是声明又是定义，b：只是声明，c：定义。</p>
<h3 id="存储类型"><a class="markdownIt-Anchor" href="#存储类型"></a> 存储类型</h3>
<p>有三个地方可用于存储变量：普通内存，运行时堆栈，硬件寄存器。</p>
<ul>
<li>所有代码块之外声明的变量总是存储在静态内存中，这类变量称为静态变量，静态变量在程序运行之前创建，整个执行过程中都存在。静态变量会被初始化为0。</li>
<li>代码块内部声明的变量的存储类型是自动的，也就是说它存储在堆栈中。自动变量在代码块执行到此块时自动变量才被创建，执行完毕后就消失。</li>
<li><code>regiser</code> 提示他们应该存储于机器的硬件寄存器而不是内存中。这类变量称为寄存器变量。<br />

<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud1.png" alt="" /></p>
</li>
<li>
<p>通过本地上传文件夹方式，上传之前解压后的OneManager文件夹<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud2.png" alt="" /><br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud3.png" alt="" /></p>
</li>
<li>
<p>创建触发器，选择API网关触发器<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud4.png" alt="" /></p>
</li>
<li>
<p>（可选）点击触发器的API服务名 <code>SCF_API_SERVICE</code>，可以自定义域名。<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud5.png" alt="" /></p>
</li>
</ol>
<h3 id="安装"><a class="markdownIt-Anchor" href="#安装"></a> 安装</h3>
<ol start="5">
<li>点击触发器下方访问路径，后安装项目，选择新建 SecretId &amp; SecretKey，返回腾讯云新建密钥，完成后将 SecretId &amp; SecretKey填入其中。</li>
</ol>
<p><img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud6.png" alt="" /></p>
<ol start="6">
<li>设置完密码后登录，通过管理-设置，点击 <code>添加Onedrive盘</code>，然后再填写相关内容就ok了。<br />
<img src= "https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/loading.gif" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cloud7.png" alt="" /></li>
</ol>
<div class="note warning">
            <ul><li>个人账号选择  MS: 国际版（商业版与个人版）</li><li>学生账号只能选择 ShareUrl: 共享链接， 对一个Onedrive文件夹共享进行使用</li></ul>
          </div>
<p>本人网盘链接 <a href="http://cloud.slyli.cn/cloud" target="_blank" rel="noopener">http://cloud.slyli.cn/cloud</a></p>
<p>目前上传了一部剧：《如此可爱的我们》。然后把之前博客中需要的视频也搬到这上面了。</p>
]]></content>
      <categories>
        <category>others</category>
      </categories>
  </entry>
  <entry>
    <title>KaTeX Supported Functions</title>
    <url>/posts/2020-10-004.html</url>
    <content><![CDATA[<h2 id="katex"><a class="markdownIt-Anchor" href="#katex"></a> <a href="https://katex.org/docs/supported.html" target="_blank" rel="noopener">KaTeX</a></h2>
<iframe src="https://katex.org/docs/supported.html" width="100%" height="800px" frameborder="0" loading="lazy" allowfullscreen></iframe>
]]></content>
      <categories>
        <category>blog</category>
      </categories>
  </entry>
  <entry>
    <title>C++</title>
    <url>/posts/2020-07-009.html</url>
    <content><![CDATA[<h3 id="virtural继承"><a class="markdownIt-Anchor" href="#virtural继承"></a> virtural继承</h3>
<pre><code>class AAAA { int  a; };
class BBBB :public virtual AAAA { int b; char a; };
class CCCC :public virtual AAAA { int c; };
class DDDD :public BBBB, public CCCC { int d; };
</code></pre>
<p>内存分布：</p>
<h4 id="aaaa"><a class="markdownIt-Anchor" href="#aaaa"></a> AAAA</h4>
<pre><code>1&gt;class AAAA	size(4):
1&gt;	+---
1&gt; 0	| a
1&gt;	+---
</code></pre>
<h4 id="bbbb"><a class="markdownIt-Anchor" href="#bbbb"></a> BBBB</h4>
<pre><code>1&gt;class BBBB	size(20):
1&gt;	+---
1&gt; 0	| {vbptr}   虚基类指针，占8位
1&gt; 8	| b
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)    虚基类中的a，占4位
1&gt;16	| a
1&gt;	+---
1&gt;BBBB::$vbtable@:  虚基类表，偏移16的位置为虚基类AAAA
1&gt; 0	| 0
1&gt; 1	| 16 (BBBBd(BBBB+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      16       0       4 0
</code></pre>
<h4 id="cccc"><a class="markdownIt-Anchor" href="#cccc"></a> CCCC</h4>
<pre><code>1&gt;class CCCC	size(20):
1&gt;	+---
1&gt; 0	| {vbptr}
1&gt; 8	| c
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)
1&gt;16	| a
1&gt;	+---
1&gt;CCCC::$vbtable@:
1&gt; 0	| 0
1&gt; 1	| 16 (CCCCd(CCCC+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      16       0       4 0
</code></pre>
<h4 id="dddd"><a class="markdownIt-Anchor" href="#dddd"></a> DDDD</h4>
<pre><code>1&gt;class DDDD	size(44):
1&gt;	+---
1&gt; 0	| +--- (base class BBBB)
1&gt; 0	| | {vbptr}
1&gt; 8	| | b
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;	| +---
1&gt;16	| +--- (base class CCCC)
1&gt;16	| | {vbptr}
1&gt;24	| | c
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;  	| | &lt;alignment member&gt; (size=4)
1&gt;	| +---
1&gt;32	| d
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)
1&gt;40	| a
1&gt;	+---
1&gt;DDDD::$vbtable@BBBB@:
1&gt; 0	| 0
1&gt; 1	| 40 (DDDDd(BBBB+0)AAAA)
1&gt;DDDD::$vbtable@CCCC@:
1&gt; 0	| 0
1&gt; 1	| 24 (DDDDd(CCCC+0)AAAA)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            AAAA      40       0       4 0
</code></pre>
<h3 id="virtual-虚函数"><a class="markdownIt-Anchor" href="#virtual-虚函数"></a> virtual 虚函数</h3>
<p>虚函数是指一个类中你希望重写(override)的成员函数，当你用一个基类指针或引用,指向一个继承类对象的时候，调用一个虚函数时, 实际调用的是继承类的版本。</p>
<pre><code>class Animal {
public :
    void  Print()
    { 
        cout &lt;&lt; &quot;Animal&quot; &lt;&lt; endl; 
    }
};
class Dog: public Animal
{
public:
    void  Print() 
    {
        cout &lt;&lt; &quot;Dog&quot; &lt;&lt; endl;
    }
private:
};
int main(int argc, char** argv)
{
    Animal* d = new Dog();
    d-&gt;Print();
}
</code></pre>
<p>没有使用<code>virtual</code>时，函数的输出的是<code>Animal</code></p>
<pre><code>class Animal {
public :
    virtual void  Print()
    { 
        cout &lt;&lt; &quot;Animal&quot; &lt;&lt; endl; 
    }
};
class Dog: public Animal
{
public:
    void  Print() 
    {
        cout &lt;&lt; &quot;Dog&quot; &lt;&lt; endl;
    }
private:
};
int main(int argc, char** argv)
{
    Animal* d = new Dog();	
    d-&gt;Print();
}
</code></pre>
<p>内存布局：</p>
<pre><code>1&gt;class Animal	size(8):
1&gt;	+---
1&gt; 0	| {vfptr}   虚表指针
1&gt;	+---
1&gt;Animal::$vftable@:    虚函数表
1&gt;	| &amp;Animal_meta
1&gt;	|  0
1&gt; 0	| &amp;Animal::Print    可能有多个虚函数
1&gt;Animal::Print this adjustor: 0

1&gt;class Dog	size(8):
1&gt;	+---
1&gt; 0	| +--- (base class Animal)
1&gt; 0	| | {vfptr}
1&gt;	| +---
1&gt;	+---
1&gt;Dog::$vftable@:
1&gt;	| &amp;Dog_meta
1&gt;	|  0
1&gt; 0	| &amp;Dog::Print
1&gt;Dog::Print this adjustor: 0
</code></pre>
<p>使用<code>virtual</code>后，函数的输出是<code>Dog</code></p>
<p>没有使用virtual之前，C++对成员函数使用静态绑定，函数的调用地址在运行前就已经固定。不考虑指针指向的内容，对于什么类型的指针就调用什么类型的函数。<br />
对于虚函数，每个派生类对象都有一个指向虚函数表的指针，访问任何虚函数都是间接通过这个指针进行的，之所以要用虚函数表，是因为调用一个虚函数的哪个版本是在运行过程（调用时指针所指的对象）才能确定的（动态绑定）。</p>
<p>这也可以叫运行时多态。</p>
<div class="note warning">
            <p>因此特性，若基类的析构函数是non-virtual的，容易造成局部销毁，导致资源泄漏。非常危险。</p>
          </div>
<p>编译期多态：对模板参数而言，多态是通过模板具现化和函数重载解析实现的。以不同的模板参数具现化导致调用不同的函数，这就是所谓的编译期多态。</p>
<pre><code>class Dog
{
public:
    void shout(){ cout &lt;&lt; &quot;Dog&quot;&lt;&lt;endl; }
};
class Cat
{
public:
    void shout(){ cout &lt;&lt; &quot;Cat&quot;&lt;&lt;endl; }
};

template &lt;typename T&gt;
void  Animal(T &amp; t)
{
    t.shout();
}

int main()
{
    Dog dog;
    Cat cat; 
    animalShout(dog);
    animalShout(cat);   
}
</code></pre>
<p>在编译之前，函数模板中t.shout()调用的是哪个接口并不确定。在编译期间，编译器推断出模板参数，因此确定调用的shout是哪个具体类型的接口。不同的推断结果调用不同的函数，这就是编译器多态。</p>
<h3 id="virtural继承下的虚函数"><a class="markdownIt-Anchor" href="#virtural继承下的虚函数"></a> virtural继承下的虚函数</h3>
<pre><code>class Base {
public:
    int x;
    virtual void func() {  };
    virtual void func1() {  };
    virtual void func2() {  };
};
class Derive:public virtual Base {
public:
    int y;
    virtual void func1() {  };
    virtual void func2() {  };
    virtual void func3() {  };
};
</code></pre>
<p>内存布局</p>
<pre><code>1&gt;class Base	size(16):
1&gt;	+---
1&gt; 0	| {vfptr}
1&gt; 8	| x
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;Base::$vftable@:
1&gt;	| &amp;Base_meta
1&gt;	|  0
1&gt; 0	| &amp;Base::func
1&gt; 1	| &amp;Base::func1
1&gt; 2	| &amp;Base::func2
1&gt;Base::func this adjustor: 0
1&gt;Base::func1 this adjustor: 0
1&gt;Base::func2 this adjustor: 0
1&gt;class Derive	size(40):
1&gt;	+---
1&gt; 0	| {vfptr}
1&gt; 8	| {vbptr}
1&gt;16	| y
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base Base)
1&gt;24	| {vfptr}
1&gt;32	| x
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;Derive::$vftable@Derive@:
1&gt;	| &amp;Derive_meta
1&gt;	|  0
1&gt; 0	| &amp;Derive::func3
1&gt;Derive::$vbtable@:
1&gt; 0	| -8
1&gt; 1	| 16 (Derived(Derive+8)Base)
1&gt;Derive::$vftable@Base@:
1&gt;	| -24
1&gt; 0	| &amp;Base::func
1&gt; 1	| &amp;Derive::func1
1&gt; 2	| &amp;Derive::func2
1&gt;Derive::func1 this adjustor: 24
1&gt;Derive::func2 this adjustor: 24
1&gt;Derive::func3 this adjustor: 0
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;            Base      24       8       4 0
</code></pre>
<h3 id="const"><a class="markdownIt-Anchor" href="#const"></a> <code>const</code></h3>
<ul>
<li>
<p>const在指针左边时，指针指向的内容是const。</p>
</li>
<li>
<p>const在指针右边时，指针是const指针</p>
</li>
<li>
<p>当const在函数名前面的时候修饰的是函数返回值。</p>
</li>
<li>
