<!DOCTYPE html><html lang="en" data-theme="light"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width,initial-scale=1"><title>The World</title><meta name="keywords" content="SlyLi"><meta name="author" content="归去来兮"><meta name="copyright" content="归去来兮"><meta name="format-detection" content="telephone=no"><meta name="theme-color" content="#ffffff"><meta http-equiv="Cache-Control" content="no-transform"><meta http-equiv="Cache-Control" content="no-siteapp"><meta name="description" content="云无心以出岫，鸟倦飞而知还。">
<meta property="og:type" content="website">
<meta property="og:title" content="The World">
<meta property="og:url" content="http://slyli.cn/page/2/index.html">
<meta property="og:site_name" content="The World">
<meta property="og:description" content="云无心以出岫，鸟倦飞而知还。">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/ava1.jpg">
<meta property="article:author" content="归去来兮">
<meta property="article:tag" content="SlyLi">
<meta name="twitter:card" content="summary">

倒立时眼睛看下方地面，有利于感受身体，保持平衡
准备倒立时，手臂保持垂直于地面，减少上肢运动幅度，臀部抬高，上肢先起，倒立起尽量减少动作幅度，下落时先收腿容易控制下落，减少幅度
靠墙倒立时，可以尝试不用脚蹬，使用手掌的力量使脚离开墙
折刀俯卧撑

</div></div></div><div class="recent-post-item"><div class="post_cover left_radius"><a href="/2020-07-002.html" title="解压wallpapper中下载的壁纸里面的pkg文件">     <img class="post_bg" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-07/pkg2.png" onerror="this.onerror=null;this.src='/img/404.jpg'" alt="解压wallpapper中下载的壁纸里面的pkg文件"></a></div><div class="recent-post-info"><a class="article-title" href="/2020-07-002.html" title="解压wallpapper中下载的壁纸里面的pkg文件">解压wallpapper中下载的壁纸里面的pkg文件</a><div class="article-meta-wrap"><span class="post-meta-date"><i class="far fa-calendar-alt"></i><span class="article-meta-label">Created</span><time class="post-meta-date-created" datetime="2020-07-05T05:52:25.000Z" title="Created 2020-07-05 13:52:25">2020-07-05</time><span class="article-meta__separator">|</span><i class="fas fa-history"></i><span class="article-meta-label">Updated</span><time class="post-meta-date-updated" datetime="2021-07-23T18:09:59.329Z" title="Updated 2021-07-24 02:09:59">2021-07-24</time></span><span class="article-meta"><span class="article-meta__separator">|</span><i class="fas fa-inbox article-meta__icon"></i><a class="article-meta__categories" href="/categories/others/">others</a></span></div><div class="content"> 下载 https://github.com/notscuffed/repkg 中的Release项目，将其中的可执行文件解压出来，并找到下载的壁纸中的.pkg，将二者放到同一目录下。

 启动powershell进入到此目录执行命令。
1./repkg extract scene.pkg

 解压完成后，会将所有文件默认放入同目录下的Output文件中。
 想要了解更多可以查看源仓库 notscuffed/repkg说明。
</div></div></div><div class="recent-post-item"><div class="post_cover right_radius"><a href="/2020-07-009.html" title="C++">     <img class="post_bg" data-lazy-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cpplanguage.png" onerror="this.onerror=null;this.src='/img/404.jpg'" alt="C++"></a></div><div class="recent-post-info"><a class="article-title" href="/2020-07-009.html" title="C++">C++</a><div class="article-meta-wrap"><span class="post-meta-date"><i class="far fa-calendar-alt"></i><span class="article-meta-label">Created</span><time class="post-meta-date-created" datetime="2020-07-21T07:32:00.000Z" title="Created 2020-07-21 15:32:00">2020-07-21</time><span class="article-meta__separator">|</span><i class="fas fa-history"></i><span class="article-meta-label">Updated</span><time class="post-meta-date-updated" datetime="2021-07-23T18:09:56.429Z" title="Updated 2021-07-24 02:09:56">2021-07-24</time></span><span class="article-meta"><span class="article-meta__separator">|</span><i class="fas fa-inbox article-meta__icon"></i><a class="article-meta__categories" href="/categories/C-C/">C/C++</a></span></div><div class="content"> virtural继承
class AAAA &#123; int  a; &#125;;
class BBBB :public virtual AAAA &#123; int b; char a; &#125;;
class CCCC :public virtual AAAA &#123; int c; &#125;;
class DDDD :public BBBB, public CCCC &#123; int d; &#125;;

内存分布：
 AAAA
1&gt;class AAAA	size(4):
1&gt;	+---
1&gt; 0	| a
1&gt;	+---

 BBBB
1&gt;class BBBB	size(20):
1&gt;	+---
1&gt; 0	| &#123;vbptr&#125;   虚基类指针，占8位
1&gt; 8	| b
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)    虚基类中的a，占4位
