
scree ...</div></div></div><div class="recent-post-item"><div class="post_cover right_radius"><a href="/posts/2020-07-003.html" title="butterfly修改及使用">     <img class="post_bg" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/static/default.png" onerror="this.onerror=null;this.src='/img/404.jpg'" alt="butterfly修改及使用"></a></div><div class="recent-post-info"><a class="article-title" href="/posts/2020-07-003.html" title="butterfly修改及使用">butterfly修改及使用</a><div class="article-meta-wrap"><time class="post-meta__date"><span class="post-meta__date-created" title="Created 2020-07-05 21:11:42"><i class="far fa-calendar-alt"></i>2020-07-05</span><span class="article-meta__separator">|</span><span class="post-meta__date-updated" title="Updated 2020-10-22 14:16:58"><i class="fas fa-history"></i>2020-10-22</span></time><span class="article-meta"><span class="article-meta__separator">|</span><i class="fas fa-inbox article-meta__icon"></i><a class="article-meta__categories" href="/categories/blog/">blog</a></span><span class="article-meta tags"><span class="article-meta__separator">|</span><i class="fas fa-tag article-meta__icon"></i><a class="article-meta__tags" href="/tags/blog/">blog</a><span class="article-meta__link">•</span><a class="article-meta__tags" href="/tags/butterfly/">butterfly</a></span></div><div class="content">官方教程上有的就不在赘述了，仔细阅读官方文档能解决绝大部分问题。
 评论
在使用评论系统之前需要首先 npm安装相应的插件，然后配置butterfly.yml中关于评论的设置。
如果不想在某个页面开启评论，可以在页面头部使用如下方式
---
title: butterfly修改
date: 2020-07-05 21:11:42
comments: false
---

 valine评论添加QQ提醒
butterfly主题把下列js代码修改后添加到butterfly.yml中的inject后面就好了。
其他的需要将下列代码添加到一个位置，使每个有valine评论的页面有下列代码。

            要先加Qmsg酱为好友。
          
1234567891011121314151617181920var title2&#x3D;&quot;msg&#x3D;您的博客又有新评论啦~ \n&quot;;var SCKEY_Qmsg&#x3D;&quot; &quot;;function send_valine_Qmsg()&#123;    var pagename&# ...</div></div></div><div class="recent-post-item"><div class="post_cover left_radius"><a href="/posts/2020-07-009.html" title="C++">     <img class="post_bg" data-src="https://cdn.jsdelivr.net/gh/slyli/slyli.github.io/image/2020-08/cpplanguage.png" onerror="this.onerror=null;this.src='/img/404.jpg'" alt="C++"></a></div><div class="recent-post-info"><a class="article-title" href="/posts/2020-07-009.html" title="C++">C++</a><div class="article-meta-wrap"><time class="post-meta__date"><span class="post-meta__date-created" title="Created 2020-07-21 15:32:00"><i class="far fa-calendar-alt"></i>2020-07-21</span><span class="article-meta__separator">|</span><span class="post-meta__date-updated" title="Updated 2020-10-19 00:06:17"><i class="fas fa-history"></i>2020-10-19</span></time><span class="article-meta"><span class="article-meta__separator">|</span><i class="fas fa-inbox article-meta__icon"></i><a class="article-meta__categories" href="/categories/C-C/">C/C++</a></span><span class="article-meta tags"><span class="article-meta__separator">|</span><i class="fas fa-tag article-meta__icon"></i><a class="article-meta__tags" href="/tags/C/">C++</a></span></div><div class="content"> virtural继承
class AAAA { int  a; };
class BBBB :public virtual AAAA { int b; char a; };
class CCCC :public virtual AAAA { int c; };
class DDDD :public BBBB, public CCCC { int d; };

内存分布：
 AAAA
1&gt;class AAAA	size(4):
1&gt;	+---
1&gt; 0	| a
1&gt;	+---

 BBBB
1&gt;class BBBB	size(20):
1&gt;	+---
1&gt; 0	| {vbptr}   虚基类指针，占8位
1&gt; 8	| b
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base AAAA)    虚基类中的a，占4位
1&gt;16	| a
1&gt;	+---
